app/controllers/posts_controller.rb

	def create
	  @post = Post.new(post_params)
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Burger"], ["description", "King"], ["created_at", "2020-04-07 22:21:04.780957"], ["updated_at", "2020-04-07 22:21:04.780957"]]

	def update
	  @post = Post.find(params[:id])
	  @post.update(params.require(:post).permit(:title, :description))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "all you need to get muscle"], ["updated_at", "2020-03-24 17:57:26.726529"], ["id", 2]]